*** solution
#+BEGIN_SRC sqlite :db warehouse.sqlite
 SELECT *
   FROM Warehouses;
#+END_SRC

#+RESULTS:
| 1 | Chicago       | 3 |
| 2 | Chicago       | 4 |
| 3 | New York      | 7 |
| 4 | Los Angeles   | 2 |
| 5 | San Francisco | 8 |

*** solution
#+BEGIN_SRC sqlite :db warehouse.sqlite
 SELECT *
   FROM Boxes
  WHERE Value > 150;
#+END_SRC

#+RESULTS:
| 0MN7 | Rocks    | 180.0 | 3 |
| 4H8P | Rocks    | 250.0 | 1 |
| 4RT3 | Scissors | 190.0 | 4 |
| 7G3H | Rocks    | 200.0 | 1 |
| 9J6F | Papers   | 175.0 | 2 |

*** solution
#+BEGIN_SRC sqlite :db warehouse.sqlite
 SELECT DISTINCT Contents
   FROM Boxes;
#+END_SRC

#+RESULTS:
| Rocks    |
| Scissors |
| Papers   |

